#include <stdio.h>
int main()
{
int i = 0;
int a,b,c,d;
for(a=1;a<10;a++)
{
    for(b=1;b<((100-10*a)/5);b++)
    {
        for(c=1;c<((100-10*a-5*b)/2);c++)
        {
            for(d=1;d<(100-(a+b+c));d++)
            {
                if (10*a+5*b+2*c+d  ==  100 && 40 == (a+b+c+d))
                {
                i = i+1;
                }

            }
        }
            
    }
}
printf("%d\n",i);
    return 0;
}

//这是一道来源于oj上的题目
/**
某人想将手中的一张面值100元的人民币换成10元、5元、2元和1元面值的票子。要求换正好40张，且每种票子至少一张。问：有几种换法？
**/